Autodesk.Revit.DB.AnnotationSymbol.removeLeader
remove a leader of this annotation symbol.

Autodesk.Revit.DB.AnnotationSymbol.addLeader
add a leader to this annotation symbol.

Autodesk.Revit.DB.AnnotationSymbol.AnnotationSymbolType
The AnnotationSymbol style of this AnnotationSymbol.
Remarks: The AnnotationSymbolType property can be used to retrieve the kind of the symbol.
This property can also be used to change the type of an annotation by setting it to a different type.
All the annotation symbol types in the project can be found using
the Document.AnnotationSymbolTypes property.

Autodesk.Revit.DB.AnnotationSymbol.GetLeaders
Returns a collection of leaders currently attached to the annotation.
Remarks:
This method supersedes an older Leaders property which has been deprecated.
Since:
2016

Autodesk.Revit.DB.AnnotationSymbol.duplicate
Duplicate this annotation symbol.
Returns: Pointer to the new annotation symbol.

Autodesk.Revit.DB.AnnotationSymbol
This object represents a symbol of the Generic Annotation.